# -*- coding: utf-8 -*-
"""
Created on Thu Sep 12 18:40:37 2024

@author: 6
"""
#%% 创建一个包含两个子图的图形，
# 在第一个子图中绘制 y = sin(x)。
# 在第二个子图中绘制 y = cos(x)。
# 添加轴标签并给每个子图添加标题。


#%% 生成以下数据的饼图：
# 数据：[15, 30, 45, 10]
# 标签：['apple', 'banana', 'cherry', 'date']
# 将 "cherry" 切片爆炸 0.1。
# 在饼图中标注每个切片的百分比。

#%% 创建函数 z = sin(sqrt(x^2 + y^2)) 的 3D 表面图。

#%% *创建一个参数螺旋的 3D 图，使用以下参数：
# x = 10 * cos(t), y = 10 * sin(t), z = t，
# 其中 t 的范围取 0 到 4π 。
# 添加轴标签和标题。

#%% *创建一个 3D 箭头图，其中向量从原点出发并指向不同方向
# 使用 cos 和 sin 函数计算相应的 u 和 v 分量。
# 在图表中添加标签和标题。

